{"class_name": "Model", "config": {"name": "model_6", "layers": [{"name": "the_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 13], "dtype": "float32", "sparse": false, "name": "the_input"}, "inbound_nodes": []}, {"name": "masking_2", "class_name": "Masking", "config": {"name": "masking_2", "trainable": true, "dtype": "float32", "mask_value": 255}, "inbound_nodes": [[["the_input", 0, 0, {}]]]}, {"name": "bidirectional_3", "class_name": "Bidirectional", "config": {"name": "bidirectional_3", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "bidir_rnn_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "linear", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["masking_2", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bidirectional_3", 0, 0, {}]]]}, {"name": "bidirectional_4", "class_name": "Bidirectional", "config": {"name": "bidirectional_4", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "bidir_rnn_2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "linear", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bidirectional_4", 0, 0, {}]]]}, {"name": "time_distributed_2", "class_name": "TimeDistributed", "config": {"name": "time_distributed_2", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 43, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "softmax", "class_name": "Activation", "config": {"name": "softmax", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["time_distributed_2", 0, 0, {}]]]}, {"name": "labels", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "name": "labels"}, "inbound_nodes": []}, {"name": "input_length", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_length"}, "inbound_nodes": []}, {"name": "label_length", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "label_length"}, "inbound_nodes": []}, {"name": "CTCloss", "class_name": "Lambda", "config": {"name": "CTCloss", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAcxwAAAB8AFwEfQF9An0DfQR0AGoBfAJ8AXwDfASDBFMAKQH6\nvAogICAgICAgIEZ1bmN0aW9uIGZvciBjb21wdXRpbmcgdGhlIGN0YyBsb3NzIChjYW4gYmUgcHV0\nIGluIGEgTGFtYmRhIGxheWVyKQogICAgICAgIDpwYXJhbSBhcmdzOiAKICAgICAgICAgICAgeV9w\ncmVkLCBsYWJlbHMsIGlucHV0X2xlbmd0aCwgbGFiZWxfbGVuZ3RoCiAgICAgICAgOnJldHVybjog\nQ1RDIGxvc3MgCiAgICAgICAgKQLaAUvaDmN0Y19iYXRjaF9jb3N0KQXaBGFyZ3PaBnlfcHJlZNoG\nbGFiZWxz2gxpbnB1dF9sZW5ndGjaDGxhYmVsX2xlbmd0aKkAcgkAAAD6TC9jb250ZW50L2RyaXZl\nL015IERyaXZlL1ZvaWNlIENvbnRyb2xsZWQgSG9tZSBBc3Npc3RhbnQvQ1RDTW9kZWwvQ1RDTW9k\nZWwucHnaFGN0Y19sb3NzX2xhbWJkYV9mdW5jOAMAAHMEAAAAAAkMAQ==\n", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["softmax", 0, 0, {}], ["labels", 0, 0, {}], ["input_length", 0, 0, {}], ["label_length", 0, 0, {}]]]}], "input_layers": [["the_input", 0, 0], ["labels", 0, 0], ["input_length", 0, 0], ["label_length", 0, 0]], "output_layers": [["CTCloss", 0, 0]]}, "keras_version": "2.3.0", "backend": "tensorflow"}