{"class_name": "Model", "config": {"name": "model_7", "layers": [{"name": "the_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 13], "dtype": "float32", "sparse": false, "name": "the_input"}, "inbound_nodes": []}, {"name": "masking_2", "class_name": "Masking", "config": {"name": "masking_2", "trainable": true, "dtype": "float32", "mask_value": 255}, "inbound_nodes": [[["the_input", 0, 0, {}]]]}, {"name": "bidirectional_3", "class_name": "Bidirectional", "config": {"name": "bidirectional_3", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "bidir_rnn_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "linear", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["masking_2", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bidirectional_3", 0, 0, {}]]]}, {"name": "bidirectional_4", "class_name": "Bidirectional", "config": {"name": "bidirectional_4", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "bidir_rnn_2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "linear", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bidirectional_4", 0, 0, {}]]]}, {"name": "time_distributed_2", "class_name": "TimeDistributed", "config": {"name": "time_distributed_2", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 43, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "softmax", "class_name": "Activation", "config": {"name": "softmax", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["time_distributed_2", 0, 0, {}]]]}, {"name": "input_length", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_length"}, "inbound_nodes": []}, {"name": "CTCdecode", "class_name": "Lambda", "config": {"name": "CTCdecode", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAgAAABLAAAAc1QAAAB8AFwCfQJ9A3wBfQR0AGoBgwBkAWsCcxx0AoIBdABq\nA3QAagR8AnQFagZ8A4MBfARkAhkAfARkAxkAfARkBBkAZAWNBWQGGQBkBhkAZAdkCI0CUwApCeEG\nAQAACiAgICAgICAgQ29tcGxldGUgQ1RDIGRlY29kaW5nIHVzaW5nIEtlcmFzIChmdW5jdGlvbiBL\nLmN0Y19kZWNvZGUpCiAgICAgICAgOnBhcmFtIGFyZ3M6IAogICAgICAgICAgICB5X3ByZWQsIGlu\ncHV0X2xlbmd0aAogICAgICAgIDpwYXJhbSBhcmd1bWVudHM6CiAgICAgICAgICAgIGdyZWVkeSwg\nYmVhbV93aWR0aCwgdG9wX3BhdGhzCiAgICAgICAgOnJldHVybjogCiAgICAgICAgICAgIEsuY3Rj\nX2RlY29kZSB3aXRoIGR0eXBlPSdmbG9hdDMyJwogICAgICAgINoKdGVuc29yZmxvd9oGZ3JlZWR5\n2gpiZWFtX3dpZHRo2gl0b3BfcGF0aHMpA3IDAAAAcgQAAAByBQAAAOkAAAAA2gdmbG9hdDMyKQHa\nBWR0eXBlKQfaAUvaB2JhY2tlbmTaDkFzc2VydGlvbkVycm9y2gRjYXN02gpjdGNfZGVjb2Rl2gJ0\nZtoHc3F1ZWV6ZSkF2gRhcmdz2glhcmd1bWVudHPaBnlfcHJlZNoMaW5wdXRfbGVuZ3Ro2glteV9w\nYXJhbXOpAHIVAAAA+kwvY29udGVudC9kcml2ZS9NeSBEcml2ZS9Wb2ljZSBDb250cm9sbGVkIEhv\nbWUgQXNzaXN0YW50L0NUQ01vZGVsL0NUQ01vZGVsLnB52iFjdGNfY29tcGxldGVfZGVjb2Rpbmdf\nbGFtYmRhX2Z1bmNEAwAAcwwAAAAADggBBAIQAhgBGAE=\n", null, null], "function_type": "lambda", "output_shape": [null, null], "output_shape_type": "raw", "arguments": {"greedy": true, "beam_width": 100, "top_paths": 1}}, "inbound_nodes": [[["softmax", 0, 0, {}], ["input_length", 0, 0, {}]]]}], "input_layers": [["the_input", 0, 0], ["input_length", 0, 0]], "output_layers": [["CTCdecode", 0, 0]]}, "keras_version": "2.3.0", "backend": "tensorflow"}