{"class_name": "Model", "config": {"name": "model_8", "layers": [{"name": "the_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 13], "dtype": "float32", "sparse": false, "name": "the_input"}, "inbound_nodes": []}, {"name": "masking_2", "class_name": "Masking", "config": {"name": "masking_2", "trainable": true, "dtype": "float32", "mask_value": 255}, "inbound_nodes": [[["the_input", 0, 0, {}]]]}, {"name": "bidirectional_3", "class_name": "Bidirectional", "config": {"name": "bidirectional_3", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "bidir_rnn_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "linear", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["masking_2", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bidirectional_3", 0, 0, {}]]]}, {"name": "bidirectional_4", "class_name": "Bidirectional", "config": {"name": "bidirectional_4", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "bidir_rnn_2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "linear", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bidirectional_4", 0, 0, {}]]]}, {"name": "time_distributed_2", "class_name": "TimeDistributed", "config": {"name": "time_distributed_2", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 43, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "softmax", "class_name": "Activation", "config": {"name": "softmax", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["time_distributed_2", 0, 0, {}]]]}, {"name": "labels", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "name": "labels"}, "inbound_nodes": []}, {"name": "input_length", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_length"}, "inbound_nodes": []}, {"name": "label_length", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "label_length"}, "inbound_nodes": []}, {"name": "CTCanalysis", "class_name": "Lambda", "config": {"name": "CTCanalysis", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAEQAAAAYAAABLAAAAc+wAAAB8AFwEfQJ9A30EfQV8AX0GdABqAYMAZAFrAnMgdAKC\nAXQDagRqBXQDagZ8AmQCZANkBGcDZAWNAmQGFwCDAX0HdANqB3QDagh8BIMBdANqCYMCfQR8BmQH\nGQB9CHwGZAgZAH0JfAZkCRkAfQp8CHKEdApqC3wHfARkCo0CXAJ9C30MbhZ0CmoMfAd8BHwJfApk\nC40EXAJ9C30MdANqB3wLZAMZAHQDag2DAn0NdABqDnwDdANqB3QDagh8BYMBdANqCYMCgwJ9DnQP\nfA18DmQMZA2NA30PdBB8D4MBfRB0AGoHfBBkDmQPjQJTACkQ4ScBAAAKICAgICAgICBDb21wbGV0\nZSBDVEMgYW5hbHlzaXMgdXNpbmcgS2VyYXMgYW5kIHRlbnNvcmZsb3cKICAgICAgICBXQVJOSU5H\nIDogdGYgaXMgcmVxdWlyZWQgCiAgICAgICAgOnBhcmFtIGFyZ3M6IAogICAgICAgICAgICB5X3By\nZWQsIGxhYmVscywgaW5wdXRfbGVuZ3RoLCBsYWJlbF9sZW4KICAgICAgICA6cGFyYW0gYXJndW1l\nbnRzOgogICAgICAgICAgICBncmVlZHksIGJlYW1fd2lkdGgsIHRvcF9wYXRocwogICAgICAgIDpy\nZXR1cm46IAogICAgICAgICAgICBsZXIgPSBsYWJlbCBlcnJvciByYXRlCiAgICAgICAg2gp0ZW5z\nb3JmbG936QEAAADpAAAAAOkCAAAAKQHaBHBlcm1nOoww4o55RT7aBmdyZWVkedoKYmVhbV93aWR0\naNoJdG9wX3BhdGhzKQLaBmlucHV0c9oPc2VxdWVuY2VfbGVuZ3RoKQRyCgAAAHILAAAAcggAAABy\nCQAAAFQpAdoEbm9ybdoHZmxvYXQzMikB2gVkdHlwZSkR2gFL2gdiYWNrZW5k2g5Bc3NlcnRpb25F\ncnJvctoCdGbaBG1hdGjaA2xvZ9oJdHJhbnNwb3Nl2gRjYXN02gdzcXVlZXpl2gVpbnQzMtoDY3Rj\n2hJjdGNfZ3JlZWR5X2RlY29kZXLaF2N0Y19iZWFtX3NlYXJjaF9kZWNvZGVycg0AAADaGWN0Y19s\nYWJlbF9kZW5zZV90b19zcGFyc2XaEHRmX2VkaXRfZGlzdGFuY2XaDUtyZXNoYXBlX1RvMUQpEdoE\nYXJnc9oJYXJndW1lbnRz2gZ5X3ByZWTaBmxhYmVsc9oMaW5wdXRfbGVuZ3Ro2glsYWJlbF9sZW7a\nCW15X3BhcmFtc9oFYmF0Y2hyBwAAAHIIAAAAcgkAAADaB2RlY29kZWTaCGxvZ19wcm9iWgxjYXN0\nX2RlY29kZWRaCHNwYXJzZV95WgllZF90ZW5zb3JaC2xlcl9wZXJfc2VxqQByKQAAAPpML2NvbnRl\nbnQvZHJpdmUvTXkgRHJpdmUvVm9pY2UgQ29udHJvbGxlZCBIb21lIEFzc2lzdGFudC9DVENNb2Rl\nbC9DVENNb2RlbC5wedohY3RjX2NvbXBsZXRlX2FuYWx5c2lzX2xhbWJkYV9mdW5jWwMAAHMoAAAA\nAA8MAQQCEAIgARQCCAEIAQgCBAEEAQIBDgIEAQQBDgISAhwBDgEIAg==\n", null, null], "function_type": "lambda", "output_shape": [null], "output_shape_type": "raw", "arguments": {"greedy": true, "beam_width": 100, "top_paths": 1}}, "inbound_nodes": [[["softmax", 0, 0, {}], ["labels", 0, 0, {}], ["input_length", 0, 0, {}], ["label_length", 0, 0, {}]]]}], "input_layers": [["the_input", 0, 0], ["labels", 0, 0], ["input_length", 0, 0], ["label_length", 0, 0]], "output_layers": [["CTCanalysis", 0, 0]]}, "keras_version": "2.3.0", "backend": "tensorflow"}